; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite3 - satellite
	instrument11 - instrument
	instrument12 - instrument
	satellite4 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	image2 - mode
	infrared3 - mode
	spectrograph4 - mode
	thermograph0 - mode
	image1 - mode
	Star4 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation0 - direction
	Star1 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star4)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared3)
	(supports instrument2 image1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument3 image1)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph0)
	(supports instrument4 image2)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star1)
	(supports instrument6 image1)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument7 image2)
	(supports instrument7 thermograph0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 thermograph0)
	(supports instrument8 image2)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 image2)
	(calibration_target instrument9 Star1)
	(supports instrument10 thermograph0)
	(supports instrument10 infrared3)
	(calibration_target instrument10 Star2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument11 image2)
	(supports instrument11 infrared3)
	(calibration_target instrument11 GroundStation0)
	(supports instrument12 spectrograph4)
	(calibration_target instrument12 GroundStation0)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
	(supports instrument13 image1)
	(supports instrument13 infrared3)
	(calibration_target instrument13 Star1)
	(supports instrument14 image1)
	(calibration_target instrument14 GroundStation0)
	(supports instrument15 thermograph0)
	(supports instrument15 spectrograph4)
	(calibration_target instrument15 Star1)
	(on_board instrument13 satellite4)
	(on_board instrument14 satellite4)
	(on_board instrument15 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet8)
)
(:goal (and
	(pointing satellite1 Planet11)
	(pointing satellite2 Star2)
	(pointing satellite3 GroundStation0)
	(pointing satellite4 Star9)
	(have_image Star5 spectrograph4)
	(have_image Phenomenon6 infrared3)
	(have_image Planet7 image2)
	(have_image Planet8 image1)
	(have_image Star9 spectrograph4)
	(have_image Star10 spectrograph4)
	(have_image Planet11 thermograph0)
))

)

; plan
1. (turn_to satellite4 star1 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star1)
   goals met: 1 of 11
2. (switch_on instrument15 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument15)
   goals met: 1 of 11
3. (calibrate satellite4 instrument15 star1)
   added: (calibrated instrument15)
   goals met: 1 of 11
4. (turn_to satellite4 star5 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 star5)
   goals met: 1 of 11
5. (take_image satellite4 star5 instrument15 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 2 of 11
6. (turn_to satellite4 star10 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 star10)
   goals met: 2 of 11
7. (take_image satellite4 star10 instrument15 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 3 of 11
8. (turn_to satellite4 planet11 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 planet11)
   goals met: 3 of 11
9. (turn_to satellite1 planet11 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet11)
   goals met: 4 of 11
10. (turn_to satellite0 star4 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star4)
   goals met: 4 of 11
11. (take_image satellite4 planet11 instrument15 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 5 of 11
12. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 5 of 11
13. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 5 of 11
14. (turn_to satellite0 phenomenon6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 11
15. (take_image satellite0 phenomenon6 instrument2 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 6 of 11
16. (turn_to satellite0 planet7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet7)
   goals met: 6 of 11
17. (take_image satellite0 planet7 instrument2 image2)
   added: (have_image planet7 image2)
   goals met: 7 of 11
18. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 7 of 11
19. (take_image satellite0 planet8 instrument2 image1)
   added: (have_image planet8 image1)
   goals met: 8 of 11
20. (turn_to satellite2 star2 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star2)
   goals met: 9 of 11
21. (turn_to satellite4 star9 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 star9)
   goals met: 10 of 11
22. (take_image satellite4 star9 instrument15 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 11 of 11
